In [35]:
import mod_sql
import pandas as pd

In [242]:
# mod_sql을 통해서 Database 클래스를 생성
db=mod_sql.Database("localhost","root","1234","ubion7",3306)

In [19]:
sql="""
    select
    `Country` as '국가',
    `Units Sold` as '판매개수',
    `Unit Price` as `가격`,
    `Unit Cost` as `원가`,
    (`Units Sold` * `Unit Price`) as `총수익`,
    (`Units Sold` * `Unit Cost`) as '총비용',
    ((`Units Sold` * `Unit Price`) - (`Units Sold` * `Unit Cost`)) as `총이윤`
    from 
    `Sales Records`

"""

db.sql_query(sql)

,국가,판매개수,가격,원가,총수익,총비용,총이윤
0,Chad,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Latvia,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Pakistan,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Democratic Republic of the Congo,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Czech Republic,3491,47.45,31.79,165647.95,110978.89,54669.06
...,...,...,...,...,...,...,...
9995,Laos,8597,47.45,31.79,407927.65,273298.63,134629.02
9996,Liechtenstein,562,437.20,263.33,245706.40,147991.46,97714.94
9997,Democratic Republic of the Congo,2524,154.06,90.93,388847.44,229507.32,159340.12
9998,South Africa,8706,421.89,364.69,3672974.34,3174991.14,497983.20
9999,Mongolia,361,152.58,97.44,55081.38,35175.84,19905.54

In [20]:
db1=pd.read_csv("../csv/Sales Records.csv")
db1=db1[["Country","Units Sold","Unit Price","Unit Cost","Total Revenue","Total Cost","Total Profit"]]
db1.columns=['국가','판매개수','가격','원가','총수익','총비용','총이융']
db1

,국가,판매개수,가격,원가,총수익,총비용,총이융
0,Chad,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Latvia,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Pakistan,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Democratic Republic of the Congo,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Czech Republic,3491,47.45,31.79,165647.95,110978.89,54669.06
...,...,...,...,...,...,...,...
9995,Laos,8597,47.45,31.79,407927.65,273298.63,134629.02
9996,Liechtenstein,562,437.20,263.33,245706.40,147991.46,97714.94
9997,Democratic Republic of the Congo,2524,154.06,90.93,388847.44,229507.32,159340.12
9998,South Africa,8706,421.89,364.69,3672974.34,3174991.14,497983.20
9999,Mongolia,361,152.58,97.44,55081.38,35175.84,19905.54

# sql에서 반올림

In [ ]:
sql="""
    select
    `Total Cost`,
    round(`Total Cost`,1)
    from 
    `Sales Records`
"""

db.sql_query(sql)

## sql 그룹화
1. Country ,Item Type을 기준으로 그룹화
2. Unit Sold의 평균,합계 생성
3. Country를 기준으로 오름차순 정렬

In [32]:
sql='''
    select
    `Country`,
    `Item Type`,
    AVG(`Units Sold`) as AVG,
    SUM(`Units Sold`) as SUM
    from 
    `Sales Records`
    group by
    `Country`,
    `Item Type`
    order by
    `Country`
    ASC
   
'''
db.sql_query(sql)

          Country        Item Type        AVG    SUM
0     Afghanistan        Baby Food  1368.0000   1368
1     Afghanistan        Beverages  4793.3333  14380
2     Afghanistan           Cereal  6101.8889  54917
3     Afghanistan          Clothes  5977.4000  29887
4     Afghanistan        Cosmetics  3044.2500  12177
...           ...              ...        ...    ...
2193     Zimbabwe             Meat  9640.0000   9640
2194     Zimbabwe  Office Supplies  4361.7500  17447
2195     Zimbabwe    Personal Care  9239.0000  18478
2196     Zimbabwe           Snacks  5438.0000  16314
2197     Zimbabwe       Vegetables  6789.0000  33945

[2198 rows x 4 columns]

In [46]:
_db=pd.read_csv("../csv/Sales Records.csv")
_db=_db[['Country','Item Type','Units Sold']].groupby(['Country','Item Type']).agg(['mean','sum'])
_db.reset_index(inplace=True)
_db
# _db.groupby(["Country","Item Type"]).agg(['mean','sum'])['Units Sold'].reset_index()

          Country        Item Type   Units Sold
                                           mean    sum
0     Afghanistan        Baby Food  1368.000000   1368
1     Afghanistan        Beverages  4793.333333  14380
2     Afghanistan           Cereal  6101.888889  54917
3     Afghanistan          Clothes  5977.400000  29887
4     Afghanistan        Cosmetics  3044.250000  12177
...           ...              ...          ...    ...
2193     Zimbabwe             Meat  9640.000000   9640
2194     Zimbabwe  Office Supplies  4361.750000  17447
2195     Zimbabwe    Personal Care  9239.000000  18478
2196     Zimbabwe           Snacks  5438.000000  16314
2197     Zimbabwe       Vegetables  6789.000000  33945

[2198 rows x 4 columns]

### dept table에서 부서의 이름(dname)이 sales인 소속 사원의 정보 출력
1. dept 테이블에서 부서이름이 sales인 deptno를 출력
2. emp 테이블에서 1번 과젱에서 나온 deptno를 기준으로 사원 출력

In [62]:
db=mod_sql.Database("localhost","root","1234","ubion7",3306)

In [68]:
sql='''
    select
    `DEPTNO`
    from
    `dept`
    where
    `DNAME`= "sales"
'''
db.sql_query(sql)

   DEPTNO
0    30.0

In [72]:
sql='''
    select
    *
    from
    `emp`
    where
    `deptno`= 30
'''
db.sql_query(sql)

    EMPNO   ENAME       JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0  7499.0   ALLEN  SALESMAN  7698.0  1981-02-20  1600.0   300.0    30.0
1  7521.0    WARD  SALESMAN  7698.0  1981-02-22  1250.0   500.0    30.0
2  7654.0  MARTIN  SALESMAN  7698.0  1981-09-28  1250.0  1400.0    30.0
3  7698.0   BLAKE   MANAGER  7839.0  1981-05-01  2850.0     0.0    30.0
4  7844.0  TURNER  SALESMAN  7698.0  1981-09-08  1500.0     0.0    30.0
5  7900.0   JAMES     CLERK  7698.0  1981-12-03   950.0     0.0    30.0

In [74]:
sql="""
    select
    *
    from
    `emp`
    where
    `deptno`=(
        select
        `deptno`
        from
        `dept`
        where
        `dname`='sales'
    )
"""
db.sql_query(sql)

    EMPNO   ENAME       JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0  7499.0   ALLEN  SALESMAN  7698.0  1981-02-20  1600.0   300.0    30.0
1  7521.0    WARD  SALESMAN  7698.0  1981-02-22  1250.0   500.0    30.0
2  7654.0  MARTIN  SALESMAN  7698.0  1981-09-28  1250.0  1400.0    30.0
3  7698.0   BLAKE   MANAGER  7839.0  1981-05-01  2850.0     0.0    30.0
4  7844.0  TURNER  SALESMAN  7698.0  1981-09-08  1500.0     0.0    30.0
5  7900.0   JAMES     CLERK  7698.0  1981-12-03   950.0     0.0    30.0

In [75]:
sql='''
    select
    `deptno`
    from
    `dept`
    where
    `dname`in ("sales" ,"research")
'''

db.sql_query(sql)

   deptno
0    20.0
1    30.0

In [77]:
sql="""
    select
    *
    from
    `emp`
    where
    `deptno`
    in
    (
        select
        `deptno`
        from
        `dept`
        where
        `dname`in ("sales" ,"research")
    )
"""

db.sql_query(sql)

     EMPNO   ENAME       JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0   7369.0   SMITH     CLERK  7902.0  1980-12-17   800.0     0.0    20.0
1   7499.0   ALLEN  SALESMAN  7698.0  1981-02-20  1600.0   300.0    30.0
2   7521.0    WARD  SALESMAN  7698.0  1981-02-22  1250.0   500.0    30.0
3   7566.0   JONES   MANAGER  7839.0  1981-04-02  2975.0     0.0    20.0
4   7654.0  MARTIN  SALESMAN  7698.0  1981-09-28  1250.0  1400.0    30.0
5   7698.0   BLAKE   MANAGER  7839.0  1981-05-01  2850.0     0.0    30.0
6   7788.0   SCOTT   ANALYST  7566.0  1987-06-28  3000.0     0.0    20.0
7   7844.0  TURNER  SALESMAN  7698.0  1981-09-08  1500.0     0.0    30.0
8   7876.0   ADAMS     CLERK  7788.0  1987-07-13  1100.0     0.0    20.0
9   7900.0   JAMES     CLERK  7698.0  1981-12-03   950.0     0.0    30.0
10  7902.0    FORD   ANALYST  7566.0  1981-12-03  3000.0     0.0    20.0

#### 내 풀이

In [112]:
dept=pd.read_csv("../csv/dept.csv")
dept2=dept.loc[(dept["DNAME"]=='RESEARCH') | (dept["DNAME"]=='SALES')]
dept2["DEPTNO"].tolist()

[20.0, 30.0]

In [117]:
emp=pd.read_csv("../csv/emp.csv")
emp.loc[(emp['DEPTNO']==dept2["DEPTNO"].tolist()[0]) | (emp['DEPTNO']==dept2["DEPTNO"].tolist()[1])]

     EMPNO   ENAME       JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0   7369.0   SMITH     CLERK  7902.0  1980-12-17   800.0     0.0    20.0
1   7499.0   ALLEN  SALESMAN  7698.0  1981-02-20  1600.0   300.0    30.0
2   7521.0    WARD  SALESMAN  7698.0  1981-02-22  1250.0   500.0    30.0
3   7566.0   JONES   MANAGER  7839.0  1981-04-02  2975.0     0.0    20.0
4   7654.0  MARTIN  SALESMAN  7698.0  1981-09-28  1250.0  1400.0    30.0
5   7698.0   BLAKE   MANAGER  7839.0  1981-05-01  2850.0     0.0    30.0
7   7788.0   SCOTT   ANALYST  7566.0  1987-06-28  3000.0     0.0    20.0
9   7844.0  TURNER  SALESMAN  7698.0  1981-09-08  1500.0     0.0    30.0
10  7876.0   ADAMS     CLERK  7788.0  1987-07-13  1100.0     0.0    20.0
11  7900.0   JAMES     CLERK  7698.0  1981-12-03   950.0     0.0    30.0
12  7902.0    FORD   ANALYST  7566.0  1981-12-03  3000.0     0.0    20.0

#### 교수님 풀이

In [126]:
_emp=pd.read_csv("../csv/emp.csv")
_dept=pd.read_csv("../csv/dept.csv")
_dept2=dept.loc[dept["DNAME"].isin(['RESEARCH',"SALES"]),"DEPTNO"].tolist()
_emp.loc[_emp['DEPTNO'].isin(_dept2)].reset_index(drop=True)

     EMPNO   ENAME       JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0   7369.0   SMITH     CLERK  7902.0  1980-12-17   800.0     0.0    20.0
1   7499.0   ALLEN  SALESMAN  7698.0  1981-02-20  1600.0   300.0    30.0
2   7521.0    WARD  SALESMAN  7698.0  1981-02-22  1250.0   500.0    30.0
3   7566.0   JONES   MANAGER  7839.0  1981-04-02  2975.0     0.0    20.0
4   7654.0  MARTIN  SALESMAN  7698.0  1981-09-28  1250.0  1400.0    30.0
5   7698.0   BLAKE   MANAGER  7839.0  1981-05-01  2850.0     0.0    30.0
6   7788.0   SCOTT   ANALYST  7566.0  1987-06-28  3000.0     0.0    20.0
7   7844.0  TURNER  SALESMAN  7698.0  1981-09-08  1500.0     0.0    30.0
8   7876.0   ADAMS     CLERK  7788.0  1987-07-13  1100.0     0.0    20.0
9   7900.0   JAMES     CLERK  7698.0  1981-12-03   950.0     0.0    30.0
10  7902.0    FORD   ANALYST  7566.0  1981-12-03  3000.0     0.0    20.0

1. emp 데이터프레임에서 JOB컬럼의 데이터를 확인하여 새로운 파생변수를 생성
2. job_code -->SALESMAN이면 1 MANAGER이면 2 나머지는 3으로 하여 새로운 파생변수에 대입

In [158]:
#emp["JOB"]

In [149]:
emp=pd.read_csv("../csv/emp.csv")
emp['JOB_CODE']=''

for i in emp.index:
    if emp.loc[i,'JOB']=='SALESMAN':
        emp.loc[i,'JOB_CODE']=1

    elif emp.loc[i,'JOB']=='MANAGER':
        emp.loc[i,'JOB_CODE']=2
        
    else:
        emp.loc[i,'JOB_CODE']=3

In [151]:
emp["JOB_CODE"]=emp['JOB'].apply(lambda x : 1 if (x=='SALESMAN') else (2 if (x=='MANAGER') else 3 ))

In [156]:
def change(x):
    if x=='SALESMAN':
        result =1
    elif x=='MANAGER':
        result=2
    else:
        result=3
    return result

emp['JOB_CODE']=emp['JOB'].apply(change)

In [157]:
emp

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3
1,7499.0,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30.0,1
2,7521.0,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30.0,1
3,7566.0,JONES,MANAGER,7839.0,1981-04-02,2975.0,0.0,20.0,2
4,7654.0,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30.0,1
5,7698.0,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,0.0,30.0,2
6,7782.0,CLARK,MANAGER,7839.0,1981-06-09,2450.0,0.0,10.0,2
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3
8,7839.0,KING,PRESIDENT,0.0,1981-11-17,5000.0,0.0,10.0,3
9,7844.0,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30.0,1
10,7876.0,ADAMS,CLERK,7788.0,1987-07-13,1100.0,0.0,20.0,3
11,7900.0,JAMES,CLERK,7698.0,1981-12-03,950.0,0.0,30.0,3
12,7902.0,FORD,ANALYST,7566.0,1981-12-03,3000.0,0.0,20.0,3
13,7934.0,MILLER,CLERK,7782.0,1982-01-23,1300.0,0.0,10.0,3

In [159]:
sql="""
    select
    `EMPNO`,
    `ENAME`,
    `JOB`,
    CASE
        WHEN `JOB`='SALESMAN'
        THEN 1
        WHEN `JOB`='MANAGER'
        THEN 2
        ELSE 3
    END as `JOB_CODE`
    from
    emp

"""
db.sql_query(sql)

     EMPNO   ENAME        JOB  JOB_CODE
0   7369.0   SMITH      CLERK         3
1   7499.0   ALLEN   SALESMAN         1
2   7521.0    WARD   SALESMAN         1
3   7566.0   JONES    MANAGER         2
4   7654.0  MARTIN   SALESMAN         1
5   7698.0   BLAKE    MANAGER         2
6   7782.0   CLARK    MANAGER         2
7   7788.0   SCOTT    ANALYST         3
8   7839.0    KING  PRESIDENT         3
9   7844.0  TURNER   SALESMAN         1
10  7876.0   ADAMS      CLERK         3
11  7900.0   JAMES      CLERK         3
12  7902.0    FORD    ANALYST         3
13  7934.0  MILLER      CLERK         3

In [162]:
sql='''
    select
    `EMPNO`,
    `ENAME`,
    `JOB`,
    if(
        `JOB`="SALESMAN",
        1,
        if(
            `JOB`="MANAGER",
            2,
            3
        )
    )as `JOB_CODE`
    from 
    emp
'''
db.sql_query(sql)

     EMPNO   ENAME        JOB  JOB_CODE
0   7369.0   SMITH      CLERK         3
1   7499.0   ALLEN   SALESMAN         1
2   7521.0    WARD   SALESMAN         1
3   7566.0   JONES    MANAGER         2
4   7654.0  MARTIN   SALESMAN         1
5   7698.0   BLAKE    MANAGER         2
6   7782.0   CLARK    MANAGER         2
7   7788.0   SCOTT    ANALYST         3
8   7839.0    KING  PRESIDENT         3
9   7844.0  TURNER   SALESMAN         1
10  7876.0   ADAMS      CLERK         3
11  7900.0   JAMES      CLERK         3
12  7902.0    FORD    ANALYST         3
13  7934.0  MILLER      CLERK         3

1. emp 데이터에서 파생변수 H/L 생성
2. SAL이 2000이상이면 HIGH, 아니면 LOW로 데이터를 삽입

In [163]:
emp

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3
1,7499.0,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30.0,1
2,7521.0,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30.0,1
3,7566.0,JONES,MANAGER,7839.0,1981-04-02,2975.0,0.0,20.0,2
4,7654.0,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30.0,1
5,7698.0,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,0.0,30.0,2
6,7782.0,CLARK,MANAGER,7839.0,1981-06-09,2450.0,0.0,10.0,2
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3
8,7839.0,KING,PRESIDENT,0.0,1981-11-17,5000.0,0.0,10.0,3
9,7844.0,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30.0,1
10,7876.0,ADAMS,CLERK,7788.0,1987-07-13,1100.0,0.0,20.0,3
11,7900.0,JAMES,CLERK,7698.0,1981-12-03,950.0,0.0,30.0,3
12,7902.0,FORD,ANALYST,7566.0,1981-12-03,3000.0,0.0,20.0,3
13,7934.0,MILLER,CLERK,7782.0,1982-01-23,1300.0,0.0,10.0,3

In [192]:
sql='''
    select
    `SAL`,
    CASE
        WHEN `SAL`>=2000
        THEN "HIgh"
        ELSE "LOW"
    END as `H/L`
    from 
    emp            
'''
db.sql_query(sql)

       SAL   H/L
0    800.0   LOW
1   1600.0   LOW
2   1250.0   LOW
3   2975.0  HIgh
4   1250.0   LOW
5   2850.0  HIgh
6   2450.0  HIgh
7   3000.0  HIgh
8   5000.0  HIgh
9   1500.0   LOW
10  1100.0   LOW
11   950.0   LOW
12  3000.0  HIgh
13  1300.0   LOW

In [187]:
sql="""
    select
    `EMPNO`,
    `ENAME`,
    `SAL`,
    if(
        `SAL`>=2000,
        "HIGH",
        "LOW"
    )as `H/L`
    from 
    emp
"""
db.sql_query(sql)

     EMPNO   ENAME     SAL   H/L
0   7369.0   SMITH   800.0   LOW
1   7499.0   ALLEN  1600.0   LOW
2   7521.0    WARD  1250.0   LOW
3   7566.0   JONES  2975.0  HIGH
4   7654.0  MARTIN  1250.0   LOW
5   7698.0   BLAKE  2850.0  HIGH
6   7782.0   CLARK  2450.0  HIGH
7   7788.0   SCOTT  3000.0  HIGH
8   7839.0    KING  5000.0  HIGH
9   7844.0  TURNER  1500.0   LOW
10  7876.0   ADAMS  1100.0   LOW
11  7900.0   JAMES   950.0   LOW
12  7902.0    FORD  3000.0  HIGH
13  7934.0  MILLER  1300.0   LOW

In [176]:
# case1
for i in emp.index:
    if emp.loc[i,'SAL']>=2000:
        emp.loc[i,"H/L"]= 'HIGH'
    else:
        emp.loc[i,"H/L"]= 'LOW'
emp

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE,H/R,H/L
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3,ROW,LOW
1,7499.0,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30.0,1,ROW,LOW
2,7521.0,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30.0,1,ROW,LOW
3,7566.0,JONES,MANAGER,7839.0,1981-04-02,2975.0,0.0,20.0,2,HIGH,HIGH
4,7654.0,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30.0,1,ROW,LOW
5,7698.0,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,0.0,30.0,2,HIGH,HIGH
6,7782.0,CLARK,MANAGER,7839.0,1981-06-09,2450.0,0.0,10.0,2,HIGH,HIGH
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3,HIGH,HIGH
8,7839.0,KING,PRESIDENT,0.0,1981-11-17,5000.0,0.0,10.0,3,HIGH,HIGH
9,7844.0,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30.0,1,ROW,LOW
10,7876.0,ADAMS,CLERK,7788.0,1987-07-13,1100.0,0.0,20.0,3,ROW,LOW
11,7900.0,JAMES,CLERK,7698.0,1981-12-03,950.0,0.0,30.0,3,ROW,LOW
12,7902.0,FORD,ANALYST,7566.0,1981-12-03,3000.0,0.0,20.0,3,HIGH,HIGH
13,7934.0,MILLER,CLERK,7782.0,1982-01-23,1300.0,0.0,10.0,3,ROW,LOW

In [185]:
#case2
emp["H/L"]=emp["SAL"].apply(lambda x: "HIGH" if(x>2000) else "LOW")
emp

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE,H/L
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3,LOW
1,7499.0,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30.0,1,LOW
2,7521.0,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30.0,1,LOW
3,7566.0,JONES,MANAGER,7839.0,1981-04-02,2975.0,0.0,20.0,2,HIGH
4,7654.0,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30.0,1,LOW
5,7698.0,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,0.0,30.0,2,HIGH
6,7782.0,CLARK,MANAGER,7839.0,1981-06-09,2450.0,0.0,10.0,2,HIGH
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3,HIGH
8,7839.0,KING,PRESIDENT,0.0,1981-11-17,5000.0,0.0,10.0,3,HIGH
9,7844.0,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30.0,1,LOW
10,7876.0,ADAMS,CLERK,7788.0,1987-07-13,1100.0,0.0,20.0,3,LOW
11,7900.0,JAMES,CLERK,7698.0,1981-12-03,950.0,0.0,30.0,3,LOW
12,7902.0,FORD,ANALYST,7566.0,1981-12-03,3000.0,0.0,20.0,3,HIGH
13,7934.0,MILLER,CLERK,7782.0,1982-01-23,1300.0,0.0,10.0,3,LOW

## join
1 emp 와 dept table을 결합

In [194]:
sql="""
    select
    *
    from
    emp
    left join
    dept
    on
    emp.DEPTNO = dept.DEPTNO
"""
db.sql_query(sql)

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,dept.DEPTNO,DNAME,LOC
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,20.0,RESEARCH,DALLAS
1,7499.0,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30.0,30.0,SALES,CHICAGO
2,7521.0,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30.0,30.0,SALES,CHICAGO
3,7566.0,JONES,MANAGER,7839.0,1981-04-02,2975.0,0.0,20.0,20.0,RESEARCH,DALLAS
4,7654.0,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30.0,30.0,SALES,CHICAGO
5,7698.0,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,0.0,30.0,30.0,SALES,CHICAGO
6,7782.0,CLARK,MANAGER,7839.0,1981-06-09,2450.0,0.0,10.0,10.0,ACCOUNTING,NEW YORK
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,20.0,RESEARCH,DALLAS
8,7839.0,KING,PRESIDENT,0.0,1981-11-17,5000.0,0.0,10.0,10.0,ACCOUNTING,NEW YORK
9,7844.0,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30.0,30.0,SALES,CHICAGO
10,7876.0,ADAMS,CLERK,7788.0,1987-07-13,1100.0,0.0,20.0,20.0,RESEARCH,DALLAS
11,7900.0,JAMES,CLERK,7698.0,1981-12-03,950.0,0.0,30.0,30.0,SALES,CHICAGO
12,7902.0,FORD,ANALYST,7566.0,1981-12-03,3000.0,0.0,20.0,20.0,RESEARCH,DALLAS
13,7934.0,MILLER,CLERK,7782.0,1982-01-23,1300.0,0.0,10.0,10.0,ACCOUNTING,NEW YORK

In [204]:
sql="""
    select
    emp.EMPNO,
    emp.ENAME,
    dept.DEPTNO,
    dept.DNAME,
    dept.LOC
    from
    emp
    right join
    dept
    on
    emp.DEPTNO = dept.DEPTNO
"""
db.sql_query(sql)

     EMPNO   ENAME  DEPTNO       DNAME       LOC
0   7934.0  MILLER    10.0  ACCOUNTING  NEW YORK
1   7839.0    KING    10.0  ACCOUNTING  NEW YORK
2   7782.0   CLARK    10.0  ACCOUNTING  NEW YORK
3   7902.0    FORD    20.0    RESEARCH    DALLAS
4   7876.0   ADAMS    20.0    RESEARCH    DALLAS
5   7788.0   SCOTT    20.0    RESEARCH    DALLAS
6   7566.0   JONES    20.0    RESEARCH    DALLAS
7   7369.0   SMITH    20.0    RESEARCH    DALLAS
8   7900.0   JAMES    30.0       SALES   CHICAGO
9   7844.0  TURNER    30.0       SALES   CHICAGO
10  7698.0   BLAKE    30.0       SALES   CHICAGO
11  7654.0  MARTIN    30.0       SALES   CHICAGO
12  7521.0    WARD    30.0       SALES   CHICAGO
13  7499.0   ALLEN    30.0       SALES   CHICAGO
14     NaN    None    40.0  OPERATIONS    BOSTON

In [218]:
pd.merge(emp,dept,on="DEPTNO",how="right")[["EMPNO","ENAME","DEPTNO","DNAME","LOC"]]

     EMPNO   ENAME  DEPTNO       DNAME       LOC
0   7782.0   CLARK    10.0  ACCOUNTING  NEW YORK
1   7839.0    KING    10.0  ACCOUNTING  NEW YORK
2   7934.0  MILLER    10.0  ACCOUNTING  NEW YORK
3   7369.0   SMITH    20.0    RESEARCH    DALLAS
4   7566.0   JONES    20.0    RESEARCH    DALLAS
5   7788.0   SCOTT    20.0    RESEARCH    DALLAS
6   7876.0   ADAMS    20.0    RESEARCH    DALLAS
7   7902.0    FORD    20.0    RESEARCH    DALLAS
8   7499.0   ALLEN    30.0       SALES   CHICAGO
9   7521.0    WARD    30.0       SALES   CHICAGO
10  7654.0  MARTIN    30.0       SALES   CHICAGO
11  7698.0   BLAKE    30.0       SALES   CHICAGO
12  7844.0  TURNER    30.0       SALES   CHICAGO
13  7900.0   JAMES    30.0       SALES   CHICAGO
14     NaN     NaN    40.0  OPERATIONS    BOSTON

### 문제
- 부서의 위치가 'NEW YORK','DALLAS'가 아닌 소속 사원의 정보를 출력

In [221]:
sql="""
        select
        *
        from
        dept
        where
        `LOC` not in ('NEW YORK',"DALLAS")
"""
db.sql_query(sql)

   DEPTNO       DNAME      LOC
0    30.0       SALES  CHICAGO
1    40.0  OPERATIONS   BOSTON

In [230]:
sql="""
        select
        DEPTNO
        from
        dept
        where
        `LOC` != 'DALLAS' 
        AND
        `LOC` != 'NEY YORK'
"""
db.sql_query(sql)

   DEPTNO
0    10.0
1    30.0
2    40.0

In [226]:
sql= """
    select
    *
    from
    emp
    where DEPTNO
    in
    (30,40)
"""
db.sql_query(sql)

    EMPNO   ENAME       JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0  7499.0   ALLEN  SALESMAN  7698.0  1981-02-20  1600.0   300.0    30.0
1  7521.0    WARD  SALESMAN  7698.0  1981-02-22  1250.0   500.0    30.0
2  7654.0  MARTIN  SALESMAN  7698.0  1981-09-28  1250.0  1400.0    30.0
3  7698.0   BLAKE   MANAGER  7839.0  1981-05-01  2850.0     0.0    30.0
4  7844.0  TURNER  SALESMAN  7698.0  1981-09-08  1500.0     0.0    30.0
5  7900.0   JAMES     CLERK  7698.0  1981-12-03   950.0     0.0    30.0

In [228]:
sql="""
    select
    *
    from
    emp
    where DEPTNO
    in(
        select
        DEPTNO
        from
        dept
        where `LOC`
        not in
        ('NEY TORK','DALLAS')
    )
"""

db.sql_query(sql)

    EMPNO   ENAME        JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0  7499.0   ALLEN   SALESMAN  7698.0  1981-02-20  1600.0   300.0    30.0
1  7521.0    WARD   SALESMAN  7698.0  1981-02-22  1250.0   500.0    30.0
2  7654.0  MARTIN   SALESMAN  7698.0  1981-09-28  1250.0  1400.0    30.0
3  7698.0   BLAKE    MANAGER  7839.0  1981-05-01  2850.0     0.0    30.0
4  7782.0   CLARK    MANAGER  7839.0  1981-06-09  2450.0     0.0    10.0
5  7839.0    KING  PRESIDENT     0.0  1981-11-17  5000.0     0.0    10.0
6  7844.0  TURNER   SALESMAN  7698.0  1981-09-08  1500.0     0.0    30.0
7  7900.0   JAMES      CLERK  7698.0  1981-12-03   950.0     0.0    30.0
8  7934.0  MILLER      CLERK  7782.0  1982-01-23  1300.0     0.0    10.0

In [229]:
sql="""
    select
    *
    from
    emp
    left join
    dept
    on 
    emp.DEPTNO =dept.DEPTNO
    where
    LOC
    not in
    ('NEY YORK',"DALLAS")
"""
db.sql_query(sql)

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,dept.DEPTNO,DNAME,LOC
0,7499.0,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30.0,30.0,SALES,CHICAGO
1,7521.0,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30.0,30.0,SALES,CHICAGO
2,7654.0,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30.0,30.0,SALES,CHICAGO
3,7698.0,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,0.0,30.0,30.0,SALES,CHICAGO
4,7782.0,CLARK,MANAGER,7839.0,1981-06-09,2450.0,0.0,10.0,10.0,ACCOUNTING,NEW YORK
5,7839.0,KING,PRESIDENT,0.0,1981-11-17,5000.0,0.0,10.0,10.0,ACCOUNTING,NEW YORK
6,7844.0,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30.0,30.0,SALES,CHICAGO
7,7900.0,JAMES,CLERK,7698.0,1981-12-03,950.0,0.0,30.0,30.0,SALES,CHICAGO
8,7934.0,MILLER,CLERK,7782.0,1982-01-23,1300.0,0.0,10.0,10.0,ACCOUNTING,NEW YORK

### 테이블의 결합
1. 유니언 결합(단순하게 행을 결합)
2. 조인 결합

In [235]:
sql="""
    select
    *
    from
    tran_1

    union
    
    select
    *
    from
    tran_2
"""
db.sql_query(sql)

     transaction_id   price         payment_date customer_id
0       T0000000113  210000  2019-02-01 01:36:57    PL563502
1       T0000000114   50000  2019-02-01 01:37:23    HD678019
2       T0000000115  120000  2019-02-01 02:34:19    HD298120
3       T0000000116  210000  2019-02-01 02:47:23    IK452215
4       T0000000117  170000  2019-02-01 04:33:46    PL542865
...             ...     ...                  ...         ...
6781    T0000006894  180000  2019-07-31 21:20:44    HI400734
6782    T0000006895   85000  2019-07-31 21:52:48    AS339451
6783    T0000006896  100000  2019-07-31 23:35:25    OA027325
6784    T0000006897   85000  2019-07-31 23:39:35    TS624738
6785    T0000006898   85000  2019-07-31 23:41:38    AS834214

[6786 rows x 4 columns]

In [238]:
sql="""
    select
    *
    from
    tran_d_1

    union

    select
    *
    from
    tran_d_2
"""
db.sql_query(sql)

      detail_id transaction_id item_id  quantity
0             0    T0000000113    S005         1
1             1    T0000000114    S001         1
2             2    T0000000115    S003         1
3             3    T0000000116    S005         1
4             4    T0000000117    S002         2
...         ...            ...     ...       ...
7139       7139    T0000006894    S004         1
7140       7140    T0000006895    S002         1
7141       7141    T0000006896    S001         2
7142       7142    T0000006897    S002         1
7143       7143    T0000006898    S002         1

[7144 rows x 4 columns]

In [240]:
sql="""
    select
    *
    from
    tran_1
    left join
    tran_d_1
    on
    tran_1.transaction_id = tran_d_1.transaction_id
"""
db.sql_query(sql)

,transaction_id,price,payment_date,customer_id,detail_id,tran_d_1.transaction_id,item_id,quantity
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0.0,T0000000113,S005,1.0
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1.0,T0000000114,S001,1.0
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2.0,T0000000115,S003,1.0
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3.0,T0000000116,S005,1.0
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4.0,T0000000117,S002,2.0
...,...,...,...,...,...,...,...,...
5238,T0000005108,210000,2019-06-15 02:42:41,HD315748,NaN,None,None,NaN
5239,T0000005109,150000,2019-06-15 03:36:16,HI215420,NaN,None,None,NaN
5240,T0000005110,50000,2019-06-15 03:44:06,IK880102,NaN,None,None,NaN
5241,T0000005111,210000,2019-06-15 04:14:06,IK074758,NaN,None,None,NaN
5242,T0000005112,50000,2019-06-15 04:42:38,HD444151,NaN,None,None,NaN

In [243]:
sql="""
    select * from
    (select * from tran_1 
    union
    select * from tran_2) as tran
    left join
    (select * from tran_d_1
    union
    select * from tran_d_2) as tran_d
    on tran.transaction_id = tran_d.transaction_id
"""
db.sql_query(sql)

,transaction_id,price,payment_date,customer_id,detail_id,tran_d.transaction_id,item_id,quantity
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,T0000000113,S005,1
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1,T0000000114,S001,1
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2,T0000000115,S003,1
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3,T0000000116,S005,1
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4,T0000000117,S002,2
...,...,...,...,...,...,...,...,...
7139,T0000006887,210000,2019-07-31 19:43:42,AS961301,7132,T0000006887,S005,1
7140,T0000006888,210000,2019-07-31 20:05:45,GD025393,7133,T0000006888,S005,1
7141,T0000006891,50000,2019-07-31 20:28:20,HI337854,7136,T0000006891,S001,1
7142,T0000006894,180000,2019-07-31 21:20:44,HI400734,7139,T0000006894,S004,1
7143,T0000006895,85000,2019-07-31 21:52:48,AS339451,7140,T0000006895,S002,1

In [245]:
tran_1=pd.read_csv("../csv/tran_1.csv")
tran_2=pd.read_csv("../csv/tran_2.csv")
tran_d_1=pd.read_csv("../csv/tran_d_1.csv")
tran_d_2=pd.read_csv("../csv/tran_d_2.csv")

In [249]:
tran=pd.concat([tran_1,tran_2],axis=0)
tran_d=pd.concat([tran_d_1,tran_d_2],axis=0)

In [252]:
pd.merge(tran,tran_d,left_on="transaction_id", right_on="transaction_id",how='left')

### 열의 이름이 다를경우 left_on, right_on을 써서 다른 이름의 열에 같은 value값을 left로 merge해준다

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1,S001,1
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2,S003,1
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3,S005,1
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4,S002,2
...,...,...,...,...,...,...,...
7139,T0000006894,180000,2019-07-31 21:20:44,HI400734,7139,S004,1
7140,T0000006895,85000,2019-07-31 21:52:48,AS339451,7140,S002,1
7141,T0000006896,100000,2019-07-31 23:35:25,OA027325,7141,S001,2
7142,T0000006897,85000,2019-07-31 23:39:35,TS624738,7142,S002,1
7143,T0000006898,85000,2019-07-31 23:41:38,AS834214,7143,S002,1

### 문자열이 포함되어 있는 경우 출력

In [255]:
sql="""
    select
    *
    from
    emp
    where
    ENAME like "%%s"
"""
db.sql_query(sql)

# ENAME like "%%s%%" 문자열에 s가 포함
# ENAME like "%%s"   문자열에 s로 끝
# ENAME like "s%%"   문자열에 s로 시작

    EMPNO  ENAME      JOB     MGR    HIREDATE     SAL  COMM  DEPTNO
0  7566.0  JONES  MANAGER  7839.0  1981-04-02  2975.0   0.0    20.0
1  7876.0  ADAMS    CLERK  7788.0  1987-07-13  1100.0   0.0    20.0
2  7900.0  JAMES    CLERK  7698.0  1981-12-03   950.0   0.0    30.0

1. pandas 이용하여 emp.csv에서 ENAME이 S로 시작하는 데이터를 출력
2. S로 끝나는 데이터를 출력
3. S가 포함되에 있는 데이터를 출력

In [273]:
for i in emp.index:

    if emp.loc[i,'ENAME'][0]=='S':
        print(emp.loc[i,'ENAME'])

SMITH
SCOTT

In [262]:
for i in emp.index:

    if emp.loc[i,'ENAME'][-1]=='S':
        print(emp.loc[i,'ENAME'])

JONES
ADAMS
JAMES

In [286]:
emp.loc[emp["ENAME"].apply(lambda x : x.startswith('S'))]["ENAME"].tolist()

['SMITH', 'SCOTT']

In [305]:
emp.loc[emp['ENAME'].str.startswith('S')]

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE,H/L
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3,LOW
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3,HIGH

In [287]:
emp.loc[emp["ENAME"].apply(lambda x : x.endswith('S'))]["ENAME"].tolist()

['JONES', 'ADAMS', 'JAMES']

In [304]:
emp.loc[emp["ENAME"].str.contains('S')]["ENAME"].tolist()
for i in emp.loc[emp["ENAME"].str.contains('S')]["ENAME"].tolist():
    print(i)

SMITH
JONES
SCOTT
ADAMS
JAMES

In [312]:
data=pd.DataFrame()
for i in emp.index:
    if emp.loc[i,"ENAME"].startswith('S') :
        data=pd.concat([data,emp.loc[[i]]],)
data

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE,H/L
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3,LOW
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3,HIGH

In [309]:
_data=[]
for i in emp.index:
    if emp.loc[i,"ENAME"].startswith('S') :
        _data.append(i)
emp.loc[_data]

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE,H/L
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3,LOW
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3,HIGH

In [314]:
emp.loc[emp['ENAME'].apply(lambda x : x.find('S')==0)]

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE,H/L
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3,LOW
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3,HIGH

In [316]:
emp.loc[emp['ENAME'].apply(lambda x : x.find('S')==(len(x)-1))]

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE,H/L
3,7566.0,JONES,MANAGER,7839.0,1981-04-02,2975.0,0.0,20.0,2,HIGH
10,7876.0,ADAMS,CLERK,7788.0,1987-07-13,1100.0,0.0,20.0,3,LOW
11,7900.0,JAMES,CLERK,7698.0,1981-12-03,950.0,0.0,30.0,3,LOW

In [322]:
### find는 찾는 값이 없으면 -1이 나온다
emp.loc[emp['ENAME'].apply(lambda x : x.find('S')!=-1)]

# emp.loc[emp['ENAME'].apply(lambda x : "S" in x)]

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,JOB_CODE,H/L
0,7369.0,SMITH,CLERK,7902.0,1980-12-17,800.0,0.0,20.0,3,LOW
3,7566.0,JONES,MANAGER,7839.0,1981-04-02,2975.0,0.0,20.0,2,HIGH
7,7788.0,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,0.0,20.0,3,HIGH
10,7876.0,ADAMS,CLERK,7788.0,1987-07-13,1100.0,0.0,20.0,3,LOW
11,7900.0,JAMES,CLERK,7698.0,1981-12-03,950.0,0.0,30.0,3,LOW